schreibfaul1/ESP32-MiniWebRadio/src/settings.h
#ifdef SPI_DISPLAY
    #undef TFT_CONTROLLER
    #undef TFT_ROTATION
    #undef TP_CONTROLLER
    #undef TP_ROTATION
    #undef DISPLAY_INVERSION
    #if (SPI_DISPLAY == 1)
        #define TFT_CONTROLLER    0
        #define TFT_ROTATION      0
        #define TP_CONTROLLER     1
        #define TP_ROTATION       2
        #define DISPLAY_INVERSION 0
    #endif
    #if (SPI_DISPLAY == 2)
        #define TFT_CONTROLLER    5 // ILI9488 or ST7796
        #define TFT_ROTATION      0
        #define TP_CONTROLLER     1 // 3.5" or 4.0"
        #define TP_ROTATION       2
        #define DISPLAY_INVERSION 0
    #endif
    #if (SPI_DISPLAY == 3)
        #define TFT_CONTROLLER    5 // ILI9488 or ST7796
        #define TFT_ROTATION      0
        #define TP_CONTROLLER     8 // FT6x63
        #define TP_ROTATION       1
        #define DISPLAY_INVERSION 1
    #endif
    #if CONFIG_IDF_TARGET_ESP32S3
    // Digital I/O used
        #define TFT_CS             8
        #define TFT_DC             12
        #define TFT_BL             10 // at -1 the brightness menu is not displayed
        #define TP_IRQ             39
        #define TP_CS              15
        #define SD_MMC_D0          11
        #define SD_MMC_CLK         13
        #define SD_MMC_CMD         14
        #define IR_PIN             4  // IR Receiver (if available)
        #define TFT_MOSI           18 // TFT and TP (FSPI)
        #define TFT_MISO           2  // TFT and TP (FSPI)
        #define TFT_SCK            17 // TFT and TP (FSPI)
        #define I2S_DOUT           9
        #define I2S_BCLK           3
        #define I2S_LRC            1
        #define I2S_MCLK           0
        #define BT_EMITTER_RX      45 // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_TX      38 // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_MODE    20 // high transmit - low receive           (-1 if not available)
        #define BT_EMITTER_CONNECT 48 // high impulse -> awake after POWER_OFF (-1 if not available)
        #define I2C_SDA            41 // I2C, dala line for capacitive touchpadand and light sensor (-1 if not available)
        #define I2C_SCL            42 // I2C, clock line for capacitive touchpadand and light sensor (-1 if not available)
        #define AMP_ENABLED        -1 // onboard amplifier (-1 if not available)
    #endif                            // CONFIG_IDF_TARGET_ESP32S3

    #if CONFIG_IDF_TARGET_ESP32P4
        #define TFT_CS             26
        #define TFT_DC             3
        #define TFT_BL             4 // at -1 the brightness menu is not displayed
        #define TP_IRQ             5
        #define TP_CS              2
        #define SD_MMC_D0          39
        #define SD_MMC_D1          40
        #define SD_MMC_D2          41
        #define SD_MMC_D3          42
        #define SD_MMC_CLK         43
        #define SD_MMC_CMD         44
        #define IR_PIN             32 // IR Receiver (if available)
        #define TFT_MOSI           20 // TFT and TP (FSPI)
        #define TFT_MISO           21 // TFT and TP (FSPI)
        #define TFT_SCK            22 // TFT and TP (FSPI)
        #define I2S_DOUT           23
        #define I2S_BCLK           24
        #define I2S_LRC            25
        #define I2S_MCLK           -1
        #define BT_EMITTER_RX      27 // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_TX      28 // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_MODE    29 // high transmit - low receive           (-1 if not available)
        #define BT_EMITTER_CONNECT 30 // high impulse -> awake after POWER_OFF (-1 if not available)
        #define I2C_SDA            7  // I2C, dala line for capacitive touchpad and light sensor (-1 if not available)
        #define I2C_SCL            8  // I2C, clock line for capacitive touchpad and light sensor (-1 if not available)
        #define AMP_ENABLED        33 // onboard amplifier (-1 if not available)
    // free pins 46, 47, 48, 49, 50, 51, 52
    #endif // CONFIG_IDF_TARGET_ESP32P4
#endif

// // —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DISPLAY [800x480] ESP32-S3 SUNTON   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32S3 == 1)
    #ifdef ESP32_8048S070
        #undef TFT_CONTROLLER
        #define TFT_CONTROLLER 7
        #undef TFT_ROTATION
        #define TFT_ROTATION 2
        #undef TP_CONTROLLER
        #define TP_CONTROLLER 7
        #undef TP_ROTATION
        #define TP_ROTATION 1

const Pins RGB_PINS = { // SUNTON 7"
    .b0 = 15, .b1 = 7, .b2 = 6, .b3 = 5, .b4 = 4, .g0 = 9, .g1 = 46, .g2 = 3, .g3 = 8, .g4 = 16, .g5 = 1, .r0 = 14, .r1 = 21, .r2 = 47, .r3 = 48, .r4 = 45, .hsync = 39, .vsync = 40, .de = 41, .pclk = 42, .bl = -1};

const Timing RGB_TIMING = {.h_res = 800, .v_res = 480, .pixel_clock_hz = 10000000, .hsync_pulse_width = 30, .hsync_back_porch = 16, .hsync_front_porch = 210, .vsync_pulse_width = 13, .vsync_back_porch = 10, .vsync_front_porch = 22};

        #define TP_IRQ             -1
        #define SD_MMC_CMD         11
        #define SD_MMC_CLK         12
        #define SD_MMC_D0          13
        #define I2S_DOUT           17
        #define I2S_BCLK           0
        #define I2S_LRC            18
        #define I2S_MCLK           -1 // important!
        #define IR_PIN             38 // IR Receiver (if available)
        #define BT_EMITTER_RX      -1 // must be -1, not enough pins
        #define BT_EMITTER_TX      -1 // must be -1, not enough pins
        #define BT_EMITTER_MODE    -1 // must be -1, not enough pins
        #define BT_EMITTER_CONNECT -1 // must be -1, not enough pins
        #define TFT_BL             2  // same as RGB_PINS.bl
        #define I2C_SDA            19 // I2C, data line for capacitive touchpad and light sensor (-1 if not available)
        #define I2C_SCL            20 // I2C, clock line for capacitive touchpad and light sensor (-1 if not available)
        #define AMP_ENABLED        -1 // onboard amplifier (-1 if not available)
    #endif
#endif // CONFIG_IDF_TARGET_ESP32S3
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DISPLAY [800x480] ESP32-S3 ELECROW 5"   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32S3 == 1)
    #ifdef ESP32_WZ8048C050
        #undef TFT_CONTROLLER
        #define TFT_CONTROLLER 7
        #undef TFT_ROTATION
        #define TFT_ROTATION 2
        #undef TP_CONTROLLER
        #define TP_CONTROLLER 7
        #undef TP_ROTATION
        #define TP_ROTATION 1

const Pins RGB_PINS = { // ELECROW 5"
    .b0 = 8, .b1 = 3, .b2 = 46, .b3 = 9, .b4 = 1, .g0 = 5, .g1 = 6, .g2 = 7, .g3 = 15, .g4 = 16, .g5 = 4, .r0 = 45, .r1 = 48, .r2 = 47, .r3 = 21, .r4 = 14, .hsync = 39, .vsync = 41, .de = 40, .pclk = 0, .bl = -1};

const Timing RGB_TIMING = {.h_res = 800, .v_res = 480, .pixel_clock_hz = 11000000, .hsync_pulse_width = 4, .hsync_back_porch = 43, .hsync_front_porch = 8, .vsync_pulse_width = 4, .vsync_back_porch = 12, .vsync_front_porch = 8};

        #define TP_IRQ     -1
        #define SD_MMC_CMD 11
        #define SD_MMC_CLK 12
        #define SD_MMC_D0  13

        #define I2C_MASTER_FREQ_HZ 400000 // 400 kHz I2C-frequency

        #define I2S_DOUT 17
        #define I2S_BCLK 42
        #define I2S_LRC  18
        #define I2S_MCLK -1 // important!

        #define IR_PIN             38 // IR Receiver (if available)
        #define BT_EMITTER_RX      -1 // must be -1, not enough pins
        #define BT_EMITTER_TX      -1 // must be -1, not enough pins
        #define BT_EMITTER_LINK    -1 // must be -1, not enough pins
        #define BT_EMITTER_MODE    -1 // must be -1, not enough pins
        #define BT_EMITTER_CONNECT -1 // must be -1, not enough pins

