schreibfaul1/ESP32-MiniWebRadio/src/settings.h
        #define TFT_BL      2  // same as RGB_PINS.bl
        #define AMP_ENABLED -1 // control pin for extenal amplifier (if available)

        #define I2C_SDA 19 // dala line for capacitive touchpadand and light sensor  (-1 if not used)
        #define I2C_SCL 20 // clock line for capacitive touchpad  and light sensor (-1 if not used)

    #endif
#endif // CONFIG_IDF_TARGET_ESP32S3
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DISPLAY [800x480] ESP32-S3 ELECROW 7"   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32S3 == 1)
    #ifdef ESP32_DIS08070H
        #undef TFT_CONTROLLER
        #define TFT_CONTROLLER 7
        #undef TFT_ROTATION
        #define TFT_ROTATION 2
        #undef TP_CONTROLLER
        #define TP_CONTROLLER 7
        #undef TP_ROTATION
        #define TP_ROTATION 1

const Pins RGB_PINS = { // ELECROW 7"
    .b0 = 15, .b1 = 7, .b2 = 6, .b3 = 5, .b4 = 4, .g0 = 9, .g1 = 46, .g2 = 3, .g3 = 8, .g4 = 16, .g5 = 1, .r0 = 14, .r1 = 21, .r2 = 47, .r3 = 48, .r4 = 45, .hsync = 39, .vsync = 40, .de = 41, .pclk = 0, .bl = -1};

const Timing RGB_TIMING = {.h_res = 800, .v_res = 480, .pixel_clock_hz = 11000000, .hsync_pulse_width = 4, .hsync_back_porch = 160, .hsync_front_porch = 1, .vsync_pulse_width = 4, .vsync_back_porch = 140, .vsync_front_porch = 1};

        #define TP_IRQ             -1
        #define SD_MMC_CMD         11
        #define SD_MMC_CLK         12
        #define SD_MMC_D0          13
        #define I2S_DOUT           17
        #define I2S_BCLK           42
        #define I2S_LRC            18
        #define I2S_MCLK           -1 // important!
        #define IR_PIN             38 // IR Receiver (if available)
        #define BT_EMITTER_RX      -1 // must be -1, not enough pins
        #define BT_EMITTER_TX      -1 // must be -1, not enough pins
        #define BT_EMITTER_LINK    -1 // must be -1, not enough pins
        #define BT_EMITTER_MODE    -1 // must be -1, not enough pins
        #define BT_EMITTER_CONNECT -1 // must be -1, not enough pins
        #define TFT_BL             2  // same as RGB_PINS.bl
        #define AMP_ENABLED        -1 // control pin for extenal amplifier (if available)
        #define I2C_SDA            19 // I2C, data line for capacitive touchpad and light sensor (-1 if not available)
        #define I2C_SCL            20 // I2C, clock line for capacitive touchpad and light sensor (-1 if not available)
    #endif
#endif // CONFIG_IDF_TARGET_ESP32S3

// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DISPLAY [800x480] ESP32-S3 WAVESHARE 7"   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32S3 == 1)
    #ifdef ESP32_S3_Touch_LCD7
        #undef TFT_CONTROLLER
        #define TFT_CONTROLLER 7
        #undef TFT_ROTATION
        #define TFT_ROTATION 2
        #undef TP_CONTROLLER
        #define TP_CONTROLLER 7
        #undef TP_ROTATION
        #define TP_ROTATION 1
const Pins RGB_PINS = { // WAVESHARE
    .b0 = 14, .b1 = 38, .b2 = 18, .b3 = 17, .b4 = 10, .g0 = 39, .g1 = 0, .g2 = 45, .g3 = 48, .g4 = 47, .g5 = 21, .r0 = 1, .r1 = 2, .r2 = 42, .r3 = 41, .r4 = 40, .hsync = 46, .vsync = 3, .de = 5, .pclk = 7, .bl = -1};

const Timing RGB_TIMING = {.h_res = 800, .v_res = 480, .pixel_clock_hz = 13000000, .hsync_pulse_width = 1, .hsync_back_porch = 1, .hsync_front_porch = 1, .vsync_pulse_width = 4, .vsync_back_porch = 4, .vsync_front_porch = 4};

        #define TP_IRQ -1

        #define SD_MMC_CMD 11
        #define SD_MMC_CLK 12
        #define SD_MMC_D0  13

        #define I2S_DOUT 19
        #define I2S_BCLK 20
        #define I2S_LRC  15
        #define I2S_MCLK -1 // important, don't change!

        #define IR_PIN             6  // IR Receiver (if available)
        #define BT_EMITTER_RX      -1 // must be -1, not enough pins
        #define BT_EMITTER_TX      -1 // must be -1, not enough pins
        #define BT_EMITTER_LINK    -1 // must be -1, not enough pins
        #define BT_EMITTER_MODE    -1 // must be -1, not enough pins
        #define BT_EMITTER_CONNECT -1 // must be -1, not enough pins

        #define TFT_BL      -1 // same as RGB_PINS.bl
        #define AMP_ENABLED -1 // control pin for extenal amplifier (if available)

        #define I2C_SDA 8 // I2C dala line for capacitive touchpad  (-1 if not used)
        #define I2C_SCL 9 // I2C clock line for capacitive touchpad (-1 if not used)
    #endif
#endif // CONFIG_IDF_TARGET_ESP32S3

// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DSI-DISPLAY [1024x600] ESP32-P4 WAVESHARE 7"   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32P4 == 1)
    #ifdef ESP32_P4_WIFI6_TOUCH_LCD7_7B
        #undef TFT_CONTROLLER
        #define TFT_CONTROLLER 8
        #undef TFT_ROTATION
        #define TFT_ROTATION 0
        #undef TP_CONTROLLER
        #define TP_CONTROLLER 7
        #undef TP_ROTATION
        #define TP_ROTATION 1

const Timing DSI_TIMING = {.h_res = 1024, .v_res = 600, .pixel_clock_mhz = 52, .hsync_pulse_width = 10, .hsync_back_porch = 160, .hsync_front_porch = 160, .vsync_pulse_width = 1, .vsync_back_porch = 23, .vsync_front_porch = 22, .lane_bit_rate_mbps = 900};

        #define TP_IRQ -1

