schreibfaul1/ESP32-MiniWebRadio/src/settings.h
        #define SD_MMC_D0  39
        #define SD_MMC_D1  40
        #define SD_MMC_D2  41
        #define SD_MMC_D3  42
        #define SD_MMC_CLK 43
        #define SD_MMC_CMD 44

        // I2S ext. DAC
        #define I2S_DOUT 2
        #define I2S_BCLK 3
        #define I2S_LRC  4
        #define I2S_MCLK -1

    // I2S onboard DAC ES8311
    // #define I2S_DOUT  9 // ES8311 DSDIN
    // #define I2S_BCLK 12 // ES8311 SCLK
    // #define I2S_LRC  10 // ES8311 LRCK
    // #define I2S_MCLK 13 // ES8311 MCLK
    // #define I2S_DIN  11 // ES8311 DOUT (microphone input)

        #define IR_PIN             5 // IR Receiver (if available)
        #define BT_EMITTER_RX      28
        #define BT_EMITTER_TX      29
        #define BT_EMITTER_LINK    30
        #define BT_EMITTER_MODE    31
        #define BT_EMITTER_CONNECT 34

        #define LCD_RESET   33
        #define TFT_BL      32 //
        #define AMP_ENABLED 53 // control pin for extenal amplifier

        #define I2C_SDA 7 // I2C dala line for capacitive touchpad
        #define I2C_SCL 8 // I2C clock line for capacitive touchpad
    #endif
#endif

// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DSI-DISPLAY [1024x600] ESP32-P4 GUITION 7"   📌📌📌 JC1060P470
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32P4 == 1)
    #ifdef JC1060P470
        #undef TFT_CONTROLLER
        #define TFT_CONTROLLER 9
        #undef TFT_ROTATION
        #define TFT_ROTATION 2
        #undef TP_CONTROLLER
        #define TP_CONTROLLER 7
        #undef TP_ROTATION
        #define TP_ROTATION 1

const Timing DSI_TIMING = {.h_res = 1024, .v_res = 600, .pixel_clock_mhz = 52, .hsync_pulse_width = 40, .hsync_back_porch = 160, .hsync_front_porch = 160, .vsync_pulse_width = 10, .vsync_back_porch = 23, .vsync_front_porch = 12, .lane_bit_rate_mbps = 750};

        #define TP_IRQ -1

        #define SD_MMC_D0  39
        #define SD_MMC_D1  40
        #define SD_MMC_D2  41
        #define SD_MMC_D3  42
        #define SD_MMC_CLK 43
        #define SD_MMC_CMD 44

        // I2S external DAC
        #define I2S_DOUT 2
        #define I2S_BCLK 3
        #define I2S_LRC  4
        #define I2S_MCLK -1

        // I2S onboard DAC ES8311
        // #define I2S_DOUT  9 // ES8311 DSDIN
        // #define I2S_BCLK 12 // ES8311 SCLK
        // #define I2S_LRC  10 // ES8311 LRCK
        // #define I2S_MCLK 13 // ES8311 MCLK

        #define IR_PIN             5 // IR Receiver (if available)
        #define BT_EMITTER_RX      -1
        #define BT_EMITTER_TX      -1
        #define BT_EMITTER_LINK    -1
        #define BT_EMITTER_MODE    -1
        #define BT_EMITTER_CONNECT -1

        #define LCD_RESET   27 //
        #define TFT_BL      23 //
        #define AMP_ENABLED 20 // control pin for onboard amplifier

        #define I2C_SDA 7 // I2C dala line for capacitive touchpad
        #define I2C_SCL 8 // I2C clock line for capacitive touchpad
    #endif
#endif

// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌 DSI-DISPLAY [480x800] ESP32-P4 GUITION 4.3" 📌📌📌 JC4880P443
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32P4 == 1)
    #ifdef JC4880P443
        #undef TFT_CONTROLLER
        #define TFT_CONTROLLER 10
        #undef TFT_ROTATION
        #define TFT_ROTATION 3
        #undef TP_CONTROLLER
        #define TP_CONTROLLER 7
        #undef TP_ROTATION
        #define TP_ROTATION 2

const Timing DSI_TIMING = {.h_res = 480, .v_res = 800, .pixel_clock_mhz = 34, .hsync_pulse_width = 12, .hsync_back_porch = 42, .hsync_front_porch = 42, .vsync_pulse_width = 2, .vsync_back_porch = 8, .vsync_front_porch = 166, .lane_bit_rate_mbps = 500};

        #define TP_IRQ -1

        #define SD_MMC_D0  39
        #define SD_MMC_D1  40
        #define SD_MMC_D2  41
        #define SD_MMC_D3  42
        #define SD_MMC_CLK 43
        #define SD_MMC_CMD 44

        // I2S external DAC
        #define I2S_DOUT 29 // DIN pin - DAC      (-1 if not available)
        #define I2S_BCLK 30 // BCK pin - DAC      (-1 if not available)
        #define I2S_LRC  31 // LCK LRCK pin - DAC (-1 if not available)
        #define I2S_MCLK -1

    // I2S onboard DAC ES8311
    // #define I2S_DOUT  9 // ES8311 DSDIN
    // #define I2S_BCLK 12 // ES8311 SCLK
    // #define I2S_LRC  10 // ES8311 LRCK
    // #define I2S_MCLK 13 // ES8311 MCLK

        #define IR_PIN             33 // IR Receiver                           (-1 if not available)
        #define BT_EMITTER_RX      32 // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_TX      28 // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_LINK    34 // high connected - low pairing status   (-1 if not available)
        #define BT_EMITTER_MODE    35 // high transmit - low receive           (-1 if not available)
        #define BT_EMITTER_CONNECT 49 // high impulse -> awake after POWER_OFF (-1 if not available)

        #define LCD_RESET   5  // see schematics JC4880P443
        #define TFT_BL      23 // see schematics JC4880P443
        #define AMP_ENABLED 11 // control pin for amplifier

        #define I2C_SDA 7 // I2C data line for capacitive touchpad
        #define I2C_SCL 8 // I2C clock line for capacitive touchpad
    #endif
#endif
